<a href="https://colab.research.google.com/github/NITI244/MFC/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
%%capture
!wget -O "titanic.csv" \
    https://raw.githubusercontent.com/NITI244/MFC/main/Files/titanic.csv

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
pd.read_csv('titanic.csv')
titanic = pd.read_csv('titanic.csv')
titanic

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [4]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
len(titanic[titanic.Pclass==1])

216

In [6]:
titanic.Survived == 0

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: Survived, Length: 891, dtype: bool

In [7]:
titanic[(titanic.Sex == "female") & (titanic.Survived == 0)]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
14            15         0       3  ...   7.8542   NaN         S
18            19         0       3  ...  18.0000   NaN         S
24            25         0       3  ...  21.0750   NaN         S
38            39         0       3  ...  18.0000   NaN         S
40            41         0       3  ...   9.4750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
854          855         0       2  ...  26.0000   NaN         S
863          864         0       3  ...  69.5500   NaN         S
882          883         0       3  ...  10.5167   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
888          889         0       3  ...  23.4500   NaN         S

[81 rows x 12 columns]

In [8]:
print(f"{81/891*100:<10.2f} %")
print(f"{810/891*100:>10.2f} %")

9.09       %
     90.91 %

In [9]:
titanic[(titanic.Sex == "male") & (titanic.Survived == 0)]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
6              7         0       1  ...  51.8625   E46         S
7              8         0       3  ...  21.0750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
881          882         0       3  ...   7.8958   NaN         S
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
886          887         0       2  ...  13.0000   NaN         S
890          891         0       3  ...   7.7500   NaN         Q

[468 rows x 12 columns]

In [10]:
titanic[titanic.Survived==0].Age.value_counts()

21.0    19
28.0    18
25.0    17
18.0    17
22.0    16
        ..
74.0     1
32.5     1
36.5     1
55.5     1
70.5     1
Name: Age, Length: 77, dtype: int64

In [11]:
print(f"{468/891*100:^5.2f}%")

52.53%

In [12]:
titanic[(titanic.Sex == "female") & (titanic.Survived == 0)]['Age'].mean()

25.046875

In [13]:
titanic[(titanic.Sex == "male") & (titanic.Survived == 0)]['Age'].mean()

31.618055555555557

In [14]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [15]:
pclasses = titanic.Pclass.unique()

for cls in sorted(pclasses):
    avg_price = titanic[titanic.Pclass == cls].Fare.mean()
    print(f"Pclass {cls} : $ {avg_price:7.2f}")

Pclass 1 : $   84.15
Pclass 2 : $   20.66
Pclass 3 : $   13.68

In [16]:
all = titanic.groupby('Pclass').Fare.mean()
dead = titanic[titanic.Survived == 0].groupby('Pclass').Fare.mean()
alive = titanic[titanic.Survived == 1].groupby('Pclass').Fare.mean()


temp = {}
for tup in zip(('all', 'dead', 'alive'), (all, dead, alive)):
    temp[tup[0]] = [f"{val:.2f}" for val in tup[1]]

pd.DataFrame(temp)

     all   dead  alive
0  84.15  64.68  95.61
1  20.66  19.41  22.06
2  13.68  13.67  13.69

In [17]:
pd.DataFrame({'all': all,
              'dead': dead,
              'alive': alive})

              all       dead      alive
Pclass
1       84.154687  64.684008  95.608029
2       20.662183  19.412328  22.055700
3       13.675550  13.669364  13.694887